package com.Tunes_Developers.Countries;

/**
 * Created by Geoffrey-Kimani on 10/1/2017.
 */
public class Greece extends Country {
    //Domains
    private String [] freeDomain = {
            "gmail.com", "yahoo.com", "hotmail.com"
    };
    private String [] domains = {
            "com", "biz", "info", "net", "org"
    };
    //Names
    private String [] firstNameMale = {
            "Αβραάμ", "Αγαθάγγελος", "Αγαθοκλής", "Αγαθόνικος", "Αγαμέμνων", "Αγαπητός", "Αγάπιος", "Άγγελος", "Αγησίλαος", "Αδάμ", "Αδαμάντιος", "Άδωνις", "Αθανάσιος", "Αθηναγόρας", "Αθηνόδωρος", "Αιμίλιος", "Ακριβός", "Ακρίτας", "Αλέξανδρος", "Αλέξιος", "Αλκιβιάδης", "Αμβρόσιος", "Αναγνώστης", "Ανανίας", "Αναξαγόρας", "Ανάργυρος", "Αναστάσιος", "Ανδροκλής", "Ανδρόνικος", "Άνθιμος", "Ανθούλης", "Αντίγονος", "Αντίπατρος", "Αντύπας", "Αντώνιος", "Απόλλων", "Απόστολος", "Αργύριος", "Άρης", "Αρίσταρχος", "Αριστόβουλος", "Αριστομένης", "Άριστος", "Αριστοτέλης", "Αριστοφάνης", "Αρτέμιος", "Αρχέλαος", "Αρχιμήδης", "Ασημής", "Ασκληπιός", "Αστέριος", "Αυγέρης", "Αύγουστος", "Αυξέντιος", "Αφέντης", "Αχιλλέας",
            "Βάιος", "Βαλάντης", "Βαλεντίνος", "Βαλέριος", "Βαρδής", "Βαρθολομαίος", "Βαρσάμος", "Βασίλειος", "Βασίλης", "Βελισσάριος", "Βενέτιος", "Βενιαμίν", "Βενιζέλος", "Βησσαρίων", "Βικέντιος", "Βλαδίμηρος", "Βλάσιος", "Βρασίδας", "Βύρων",
            "Γαβριήλ", "Γαλάτιος", "Γαληνός", "Γαρύφαλλος", "Γεράσιμος", "Γεώργιος", "Γκίκας", "Γρηγόριος",
            "Δαμασκηνός", "Δαμιανός", "Δανιήλ", "Δημήτριος", "Δημοκράτης", "Δημόκριτος", "Δήμος", "Δημοσθένης", "Δίκαιος", "Διογένης", "Διομήδης", "Διονύσιος", "Δομήνικος", "Δράκων", "Δρόσος", "Δωρόθεος",
            "Ειρηναίος", "Έκτορας", "Ελευθέριος", "Ελισσαίος", "Εμμανουήλ", "Έξαρχος", "Επαμεινώνδας", "Ερμής", "Ερμόλαος", "Ερρίκος", "Ερωτόκριτος", "Ευάγγελος", "Ευγένιος", "Ευδόξιος", "Ευθύμιος", "Ευκλείδης", "Ευμένιος", "Ευριπίδης", "Ευσέβιος", "Ευστάθιος", "Ευστράτιος", "Ευτύχιος", "Εφραίμ",
            "Ζαφείριος", "Ζαχαρίας", "Ζηνόβιος", "Ζήνων",
            "Ηλίας", "Ηρακλής", "Ηρόδοτος", "Ησαΐας",
            "Θαλής", "Θεμιστοκλής", "Θεοδόσιος", "Θεόδουλος", "Θεόδωρος", "Θεόκλητος", "Θεολόγος", "Θεόπιστος", "Θεοτόκης", "Θεοφάνης", "Θεόφιλος", "Θεόφραστος", "Θεοφύλακτος", "Θεοχάρης", "Θησεύς", "Θουκυδίδης", "Θρασύβουλος", "Θωμάς",
            "Ιάκωβος", "Ιάσων", "Ιγνάτιος", "Ιερεμίας", "Ιερόθεος", "Ιερώνυμος", "Ίκαρος", "Ιορδάνης", "Ιουλιανός", "Ιούλιος", "Ιπποκράτης", "Ιππόλυτος", "Ισαάκ", "Ισίδωρος", "Ιωακείμ", "Ιωάννης", "Ίων", "Ιωνάς", "Ιωσήφ",
            "Καλλίνικος", "Κάρολος", "Κηρύκος", "Κίμων", "Κλεάνθης", "Κλέαρχος", "Κλεόβουλος", "Κλεομένης", "Κλεόπας", "Κλήμης", "Κομνηνός", "Κορνήλιος", "Κοσμάς", "Κρυστάλλης", "Κυπριανός", "Κυριαζής", "Κυριάκος", "Κύρος", "Κωνσταντίνος",
            "Λαέρτης", "Λάζαρος", "Λάμπρος", "Λαοκράτης", "Λάσκαρης", "Λαυρέντιος", "Λέανδρος", "Λεμονής", "Λεονάρδος", "Λέων", "Λεωνίδας", "Λογοθέτης", "Λουδοβίκος", "Λουκάς", "Λουκιανός", "Λυκούργος", "Λύσανδρος",
            "Μαγδαληνός", "Μακάριος", "Μαρίνος", "Μάριος", "Μάρκος", "Μαρτίνος", "Ματθαίος", "Μαυρίκιος", "Μαυροειδής", "Μαύρος", "Μεγακλής", "Μεθόδιος", "Μελέτιος", "Μένανδρος", "Μενέλαος", "Μερκούριος", "Μηνάς", "Μιλτιάδης", "Μίνωας", "Μιχαήλ",
            "Ναθαναήλ", "Ναπολέων", "Νέαρχος", "Νεκτάριος", "Νεοκλής", "Νεόφυτος", "Νίκανδρος", "Νικήτας", "Νικηφόρος", "Νικόδημος", "Νικόλαος", "Νίκων",
            "Ξανθός", "Ξενοφών",
            "Οδυσσέας", "Όθων", "Όμηρος", "Ορέστης", "Ορφέας",
            "Παναγιώτης", "Πανορμίτης", "Πανταζής", "Παντελεήμων", "Παρασκευάς", "Παράσχος", "Πάρις", "Πασχάλης", "Πάτροκλος", "Παύλος", "Παυσανίας", "Πελοπίδας", "Περικλής", "Πέτρος", "Πίνδαρος", "Πλάτων", "Πλούταρχος", "Πολύβιος", "Πολύδωρος", "Πολυζώης", "Πολύκαρπος", "Πολυκράτης", "Πολυχρόνιος", "Πραξιτέλης", "Πρόδρομος", "Προκόπιος", "Προμηθέας", "Πυθαγόρας", "Πύρρος",
            "Ράλλης", "Ραφαήλ", "Ρήγας", "Ρίζος", "Ροδόφλος", "Ρωμανός",
            "Σάββας", "Σαμουήλ", "Σαράντης", "Σεβαστιανός", "Σεραφείμ", "Σέργιος", "Σολομών", "Σόλων", "Σοφοκλής", "Σπυρίδων", "Σταμάτιος", "Σταύρος", "Στέργιος", "Στέφανος", "Στυλιανός", "Συμεών", "Σώζων", "Σωκράτης", "Σωτήριος",
            "Ταξίαρχος", "Τηλέμαχος", "Τιμόθεος", "Τιμολέων", "Τίμων", "Τίτος", "Τριαντάφυλλος", "Τρύφων", "Τσαμπίκος",
            "Υάκινθος",
            "Φαίδων", "Φανούριος", "Φιλήμων", "Φίλιππος", "Φοίβος", "Φραγκίσκος", "Φρειδερίκος", "Φρίξος", "Φωκάς", "Φωκίων", "Φωτεινός", "Φώτιος",
            "Χαράλαμπος", "Χαρίλαος", "Χαρίτος", "Χρήστος", "Χριστόδουλος", "Χριστόφορος", "Χρύσανθος", "Χρυσοβαλάντιος", "Χρυσόστομος",
    };
    private String [] firstNameFemale = {
            "Αποστολία", "Αυγή", "Αγάθη", "Αγάπη", "Αγγελική", "Αγλαΐα", "Αγνή", "Αγόρω", "Αδαμαντία", "Αηδόνα", "Αθανασία", "Αθηνά", "Αθηνοδώρα", "Αικατερίνη", "Αιμιλία", "Ακριβή", "Αλεξάνδρα", "Αλεξία", "Αλίκη", "Άλκηστις", "Αλκινόη", "Αμαλία", "Αμβροσία", "Αμφιθέα", "Αμφιτρίτη", "Ανάργυρη", "Αναστασία", "Ανατολή", "Ανδριανή", "Ανδρομάχη", "Ανδρομέδα", "Ανδρονίκη", "Ανθή", "Άννα", "Αντιγόνη", "Αντωνία", "Απολλωνία", "Αποστολία", "Αργυρώ", "Αρετή", "Αριάδνη", "Αριστέα", "Άρτεμις", "Αρτεμισία", "Αρχοντία", "Ασημίνα", "Ασπασία", "Αστέρω", "Αταλάντη", "Αυγουστίνα", "Αφέντρα", "Αφροδίτη", "Αχιλλεία",
            "Βάγια", "Βαλάντω", "Βαλεντίνα", "Βαλέρια", "Βαρβάρα", "Βαρσαμία", "Βασιλεία", "Βασιλική", "Βεατρίκη", "Βελισσαρία", "Βενετία", "Βερόνικα", "Βησσαρία", "Βικέντια", "Βικτόρια", "Βιολέτα", "Βιργινία", "Βλασία", "Βρυσηίς",
            "Γαβριέλλα", "Γαλάτεια", "Γαλήνη", "Γαρυφαλλιά", "Γενοβέφα", "Γερακίνα", "Γερασιμούλα", "Γεσθημανή", "Γεωργία", "Γιασεμή", "Γκόλφω", "Γλαύκη", "Γλυκερία", "Γραμματική",
            "Δαβιδούλα", "Δαμασκηνή", "Δαμιανή", "Δανάη", "Δάφνη", "Δέσποινα", "Δήμητρα", "Δημούλα", "Διαλεκτή", "Διδώ", "Δικαία", "Διονυσία", "Δόμνα", "Δροσιά", "Δωροθέα",
            "Ειρήνη", "Ελένη", "Ελεονόρα", "Ελευθερία", "Ελισάβετ", "Έλλη", "Ελπίς", "Εμμανουέλα", "Επιστήμη", "Ερασμία", "Ερατώ", "Εριέτα", "Εριφύλη", "Ερμιόνη", "Ερωφίλη", "Εύα", "Ευαγγελία", "Ευανθία", "Ευγενία", "Ευδοκία", "Ευδοξία", "Ευθαλία", "Ευθυμία", "Εύκλεια", "Ευλαμπία", "Ευρυδίκη", "Ευρύκλεια", "Ευσεβεία", "Ευσταθία", "Ευστρατία", "Ευτέρπη", "Ευτυχία",
            "Ζαμπέτα", "Ζαφειρία", "Ζαχαρούλα", "Ζηναϊς", "Ζηνοβία", "Ζησούλα", "Ζωή",
            "Ήβη", "Ηλέκτρα", "Ήλια", "Ηλιάνα", "Ήρα", "Ηράκλεια", "Ηώ",
            "Θαλασσινή", "Θάλεια", "Θεανώ", "Θέκλα", "Θέμις", "Θεμιστόκλεια", "Θεοδοσία", "Θεοδότη", "Θεοδούλη", "Θεοδώρα", "Θεόκλεια", "Θεολογία", "Θεοπίστη", "Θεοφανία", "Θεοφίλη", "Θεοφύλακτη", "Θεοχαρούλα", "Θέτις", "Θεώνη", "Θηρεσία", "Θωμαίς",
            "Ιακωβίνα", "Ιγνατία", "Ινώ", "Ιοκάστη", "Ιορδανία", "Ιουλία", "Ιουλιανή", "Ιππολύτη", "Ίρις", "Ισαβέλλα", "Ισιδώρα", "Ισμήνη", "Ιφιγένεια", "Ιωάννα", "Ιωσηφίνα",
            "Καλή", "Καλλίνικη", "Καλλιόπη", "Καλλιρρόη", "Καλομοίρα", "Καλυψώ", "Κανέλλα", "Καρυοφυλλιά", "Κασσάνδρα", "Κασσιανή", "Κερασιά", "Κλαίρη", "Κλειώ", "Κλεοπάτρα", "Κλημεντίνη", "Κλυταιμνήστρα", "Κοκκώνα", "Κομνηνή", "Κονδυλία", "Κοραλία", "Κορνηλία", "Κόσμια", "Κρινιώ", "Κρυσταλλένια", "Κυβέλη", "Κυδωνία", "Κυπαρισσία", "Κυπριανή", "Κυριακή", "Κωνσταντίνα",
            "Λαζαρία", "Λαμπρινή", "Λασκαρίνα", "Λαυρεντία", "Λεμονιά", "Λευκοθέα", "Λεώνη", "Λεωνιδιά", "Λήδα", "Λητώ", "Λουίζα", "Λουκία", "Λουλουδένια", "Λυγερή", "Λυδία",
            "Μαγδαληνή", "Μακρίνα", "Μαλαματένια", "Μαλβίνα", "Μάνθα", "Μαντώ", "Μαργαρίτα", "Μάρθα", "Μαρία", "Μαριάνθη", "Μαρίνα", "Μαρκέλλα", "Ματθίλδη", "Μαύρα", "Μελένια", "Μελέτια", "Μελίνα", "Μελπομένη", "Μερόπη", "Μεταξία", "Μηλιά", "Μιράντα", "Μιχαέλα", "Μόσχα", "Μυρσίνη",
            "Ναυσικά", "Νεκταρία", "Νεόκλεια", "Νερατζιά", "Νεφέλη", "Νίκη", "Νικητία", "Νικολέτα",
            "Ξανθή", "Ξανθίππη", "Ξένη",
            "Οδύσσεια", "Όλγα", "Ολύμπια", "Ουρανία",
            "Παγώνα", "Παναγία", "Παναγιώτα", "Πανδώρα", "Παντελία", "Πανωραία", "Παρασκευή", "Παρθένα", "Πασχαλιά", "Παταπία", "Παυλίνα", "Πελαγία", "Περιστέρα", "Περσεφόνη", "Πέτρα", "Πηγή", "Πηνελόπη", "Ποθητή", "Πολύβια", "Πολύδωρα", "Πολύμνια", "Πολυξένη", "Πολυτίμη", "Πολυχρονία", "Πούλια", "Προδρομία",
            "Ραλλία", "Ρέα", "Ρεβέκκα", "Ρεγγίνα", "Ρηγούλα", "Ροδιά", "Ρόζα", "Ρουμπίνη", "Ρούσα", "Ρωξάνη",
            "Σαββούλα", "Σαλώμη", "Σαπφώ", "Σάρρα", "Σεβαστή", "Σεβαστιανή", "Σελήνη", "Σεμίνα", "Σεραφεία", "Σμαράγδα", "Σουλτάνα", "Σουμέλα", "Σοφία", "Σπάρτη", "Σπυριδούλα", "Σταματίνα", "Σταυρούλα", "Στεργιανή", "Στεφανία", "Στυλιανή", "Συμεωνία", "Σωζούσα", "Σωτηρία", "Σωφρονία",
            "Ταξιαρχία", "Τατιάνα", "Τερψιχόρη", "Τιμοθέα", "Τριαντάφυλλη", "Τρισεύγενη", "Τρυφωνία", "Τσαμπίκα",
            "Υακίνθη", "Υβόννη", "Υπαπαντή",
            "Φαίδρα", "Φανουρία", "Φεβρωνία", "Φερενίκη", "Φιλαρέτη", "Φιλίππα", "Φιλιππία", "Φιλιώ", "Φιλοθέη", "Φιλομήλα", "Φλώρα", "Φλωρεντία", "Φοίβη", "Φραντζέσκα", "Φρειδερίκη", "Φρύνη", "Φωτεινή",
            "Χάιδω", "Χαρά", "Χαραλαμπία", "Χάρη", "Χαρίκλεια", "Χιονιά", "Χλόη", "Χριστοδούλα", "Χριστόφιλη", "Χριστοφόρα", "Χρυσάνθη", "Χρυσαυγή", "Χρυσαφένια", "Χρυσοβαλάντω", "Χρυσόστομη", "Χρυσούλα",
    };
    private String [] lastNameMale = {
            "Αγγελίδης", "Αγγελόπουλος", "Αθανασιάδης", "Αλαφούζος", "Αλεβίζος", "Αλεξόπουλος", "Αλιβιζάτος", "Αναγνωστόπουλος", "Αναστασιάδης", "Αναστασίου", "Ανδρεάδης", "Αντωνιάδης", "Αντωνόπουλος", "Αποστολόπουλος",
            "Αξιώτης", "Βαρουξής", "Βασιλείου", "Βασιλόπουλος", "Βενιζέλος", "Βέργας", "Βιτάλης", "Βούλγαρης", "Γαλάνης", "Γερμανός", "Γεωργίου", "Γεωργιάδης", "Γιάγκος", "Γιαννόπουλος", "Γιαννακόπουλος", "Γιάνναρης",
            "Γούσιος", "Γρηγοριάδης", "Δασκαλόπουλος", "Δελής", "Διαμαντόπουλος", "Δημητριάδης", "Δουρέντης", "Ελευθερόπουλος", "Ελευθεριάδης", "Ευθυμιάδης", "Ευσταθιάδης", "Ευταξίας", "Ζαχαριάδης", "Ζερβός", "Ζωγραφός",
            "Ηλιάδης", "Ηλιόπουλος", "Θεοτόκης", "Θεωδωρόπουλος", "Θεωδώρου", "Θεωδωρίδης", "Ιατρίδης", "Ιωαννίδης", "Καλύβας", "Καραβίας", "Καννελόπουλος", "Καραγιάννης","Κεδίκογλου", "Κολιάτσος", "Κόκκινος", "Κομνηνός",
            "Κοντολέων", "Κοντός", "Κόρακας", "Κορομηλάς", "Κορωναίος", "Κοσμόπουλος", "Κουταλιανός", "Κυπραίος", "Κωνσταντίνου", "Κωνσταντινίδης", "Κωνσταντόπουλος", "Κωστόπουλος", "Κρητικός", "Κυριακόπουλος", "Λαμέρας",
            "Λαμπρόπουλος", "Λούλης", "Μακρής", "Μανιάκης", "Μαρκόπουλος", "Μαυρλίδης", "Μεταξάς", "Μιχαηλίδης", "Μπλέτσας", "Νικολαΐδης", "Νικολάκος", "Νικολόπουλος", "Ξανθόπουλος", "Ξένος", "Οικονομίδης", "Ουζουνίδης",
            "Παναγιωτίδης", "Πανταζής", "Παπαγεωργίου", "Παπάγος", "Παπαδάκης", "Παπαδόπουλος", "Παπάζογλου", "Παπακώστας", "Παπανδρέου", "Παπανικολάου", "Παπαντωνίου", "Παπαστεφάνου", "Παπαφιλίππου", "Παπαϊωάννου", "Παππάς",
            "Παυλόπουλος", "Πολίτης", "Πρωτοβεστιάριος", "Πρωτονοτάριος", "Ρούσσος", "Ρέντης", "Ράγκος", "Ρόκας", "Σακελλάρης", "Σαμαράς", "Σκλαβούνος", "Σπανός", "Σιδέρης", "Σπηλιωτόπουλος", "Σπυρόπουλος", "Σταματιάδης",
            "Σταυρόπουλος", "Στεφανόπουλος", "Ταμτάκος", "Τοκατλίδης", "Τριανταφυλλίδης", "Τρικούπη", "Τρικούπης", "Φιλιππίδης", "Φλέσσας", "Φωτιάδης", "Φωτόπουλος", "Χαραλαμπίδης", "Χατζηνικόλαου", "Χριστόπουλος",
    };
    private String [] lastNameFemale = {
            "Αγγελίδου", "Αγγελοπούλου", "Αλεξάνδρου", "Αλεξάνδρου", "Αλεξίου", "Αναγνώστου", "Αναστασίου", "Ανδρέου", "Αντωνοπούλου", "Ανυφαντή", "Ανυφαντή", "Αργυρού", "Βαριμπόμπη", "Βιτάλη", "Γάσπαρη", "Γαλάνη", "Γεννήτη",
            "Γερμανού", "Γεωγιάδου", "Γεωργίβαλου", "Γεωργίου", "Γιακουμή", "Γιαννακοπούλου", "Γρηγοριάδου", "Δασκαλοπούλου", "Διδασκάλου", "Δημητριάδου", "Ελευθερίου", "Ευθυμιάδου", "Ηλιοπούλου", "Θεοτόκου", "Θεωδωροπούλου",
            "Θεωδώρου", "Θεωδωρίδου", "Ιωάννου", "Καπετανάκη", "Καπνού", "Καρσιβάνη", "Κοκκίνου", "Κωνσταντινίδου", "Κωνσταντίνου", "Κυριακοπούλου", "Λάσκαρη", "Λασκαρού", "Μάκρη", "Μακρή", "Μοραΐτη", "Μπόγρη", "Μυλωνά",
            "Νικολάου", "Νικολοπούλου", "Ξανθοπούλου", "Οικονομίδου", "Οικονομοπούλου", "Οικονόμου", "Παπαδοπούλου", "Παπακιρίσκου", "Παπακωνσταντίνου", "Παπαμάρκου", "Παπαστάμου", "Ράφτη", "Σακελλαρίου", "Σελινά", "Σκουτέρη",
            "Σπανού", "Σταματιάδου", "Σωπολιάτη", "Τριανταφυλλίδου", "Φοσκιά", "Φωτιάδου", "Χαραλαμπίδου", "Χατζηιωάννου",
    };
    //Phone Numbers
    private String [] phoneFormats = {
            // International formats
            "+30 2# ########",
            "+30 2## #######",
            "+30 2### ######",
            "+302#########",

            "+3069########",
            "+30 69 ########",
            "+30 69########",
            "+30 69# #######",
            "+30 69# ### ####",
            "+30 69# #### ###",
            "+30 69## ######",
            "+30 69## ## ## ##",
            "+30 69## ### ###",

            // Standard format
            "2#########",
            "2## #######",
            "2### ######",

            "69########",
            "69# #######",
            "69# ### ####",
            "69# #### ###",
            "69## ######",
            "69## ## ## ##",
            "69## ### ###",

            // International formats
            "+3069########",
            "+30 69########",
            "+30 69# #######",
            "+30 69# ### ####",
            "+30 69# #### ###",
            "+30 69## ######",
            "+30 69## ## ## ##",
            "+30 69## ### ###",

            // Standard formats
            "69########",
            "69# #######",
            "69# ### ####",
            "69# #### ###",
            "69## ######",
            "69## ## ## ##",
            "69## ### ###",

            // International formats
            "+30 800#######",
            "+30 800 #######",
            "+30 800 ## #####",
            "+30 800 ### ####",

            // Standard formats
            "800#######",
            "800 #######",
            "800 ## #####",
            "800 ### ####",
    };
    //Regions
    private String [] county = {
            "Άβδηρα", "Αγαθονήσι", "Αγιά", "Άβδηρα", "Αγαθονήσι", "Αγιά", "Αγία Βαρβάρα", "Αγία Παρασκευή", "Άγιοι Ανάργυροι-Καματερό", "Άγιος Βασίλειος", "Άγιος Δημήτριος", "Άγιος Ευστράτιος", "Άγιος Νικόλαος", "Αγκίστρι", "Άγραφα", "Αγρίνιο", "Αθήνα", "Αιγάλεω", "Αιγιάλεια", "Αίγινα", "Άκτιο-Βόνιτσα", "Αλεξάνδρεια", "Αλεξανδρούπολη", "Αλίαρτος", "Άλιμος", "Αλμυρός", "Αλμωπία", "Αλόννησος", "Αμάρι", "Αμοργός", "Αμπελόκηποι-Μενεμένη", "Αμύνταιο", "Αμφίκλεια-Ελάτεια", "Αμφιλοχία", "Αμφίπολη", "Ανατολική Μάνη", "Ανάφη", "Ανδρίτσαινα-Κρέστενα", "Άνδρος", "Αντίπαρος", "Ανώγεια", "Αποκορώνας", "Αργιθέα", "Άργος-Μυκήνες", "Αριστοτέλης", "Αρριανά", "Άρτα", "Αρχαία Ολυμπία", "Αρχαία Πέλλα", "Αρχάνες-Αστερούσια", "Ασπρόπυργος", "Αστυπάλαια", "Αχαρνές", "Βάρη-Βούλα-Βουλιαγμένη", "Βέλο-Βόχα", "Βέροια", "Βιάννος", "Βισαλτία", "Βοΐο", "Βόλβη", "Βόλος", "Βόρεια Κυνουρία", "Βορεία Τζουμέρκα", "Βριλήσσια", "Βύρωνας", "Γαλάτσι", "Γαύδος", "Γεώργιος Καραϊσκάκης", "Γλυφάδα", "Γόρτυνα", "Γορτυνία", "Γρεβενά", "Δάφνη-Υμηττός", "Δέλτα", "Δελφοί", "Δεσκάτη", "Διδυμότειχο", "Δίον-Ολύμπος", "Διόνυσος", "Δίρφυς-Μεσσαπία", "Δίστομο-Αράχοβα-Αντικύρα", "Δομοκός", "Δοξάτο", "Δράμα", "Δυτική Αχαΐα", "Δυτική Μάνη", "Δυτική Οιχαλία", "Δυτική Πύλος-Νέστορας", "Δωδώνη", "Δωρίδα", "Έδεσσα", "Ελασσόνα", "Ελαφόνησος", "Ελευσίνα", "Ελληνικό-Αργυρούπολη", "Εμμανουήλ Παππάς", "Εορδαία", "Επίδαυρος", "Ερέτρια", "Ερμιονίδα", "Ερύμανθος", "Ευρώτας", "Ζαγορά-Μουρέσι", "Ζαγόρι", "Ζάκυνθος", "Ζαχάρω", "Ζηρός", "Ζίτσα", "Ζωγράφου", "Ηγουμενίτσα", "Ηλίδα", "Ηλιούπολη", "Ηράκλεια", "Ηράκλειο", "Ηράκλειο", "Θάσος", "Θερμαϊκός", "Θέρμη", "Θέρμο", "Θεσσαλονίκη", "Θήβα", "Θήρα", "Ίασμος", "Ιεράπετρα", "Ιθάκη", "Ικαριά", "Ίλιο", "Ίος", "Ιστιαία-Αιδηψός", "Ιωάννινα", "Καβάλα", "Καισαριανή", "Καλάβρυτα", "Καλαμαριά", "Καλαμάτα", "Καλαμπάκα", "Καλλιθέα", "Καλλικράτεια-Μουδανιά", "Κάλυμνος", "Κάνδανος-Σέλινο", "Καρδίτσα", "Κάρπαθος", "Καρπενήσι", "Κάρυστος", "Κάσος", "Κασσάνδρα", "Καστοριά", "Κατερίνη", "Κέα", "Κεντρικά Τζουμέρκα", "Κερατσίνι-Δραπετσώνα", "Κέρκυρα", "Κεφαλονιά", "Κηφισιά", "Κιλελέρ", "Κιλκίς", "Κίμωλος", "Κίσσαμος", "Κοζάνη", "Κομοτηνή", "Κόνιτσα", "Κορδελιό-Εύοσμος", "Κόρινθος", "Κορυδαλλός", "Κύθηρα", "Κύθνος", "Κυλλήνη", "Κύμη-Αλιβέρι", "Κωρωπί", "Κως", "Λαγκαδάς", "Λαμία", "Λάρισα", "Λαύριο", "Λειψοί", "Λέρος", "Λέσβος", "Λευκάδα", "Λήμνος", "Λιβαδειά", "Λίμνη Πλαστήρα", "Λοκροί", "Λουτράκι-Άγιoι Θεόδωροι", "Λυκόβρυση-Πεύκη", "Μακρακώμη", "Μαλεβίζι", "Μάνδρα-Ειδυλλία", "Μαντούδι-Λίμνη", "Μαραθώνα", "Μαρκόπουλο Μεσογαίας", "Μαρούσι", "Μαρώνεια-Σάπες", "Μεγαλόπολη", "Μεγανήσι", "Μέγαρα", "Μεγίστη", "Μεσολόγγι", "Μεσσήνη", "Μεταμόρφωση", "Μέτσοβο", "Μήλος", "Μινώα Πεδιάδα", "Μονεμβασιά", "Μοσχάτο-Ταύρος", "Μουζάκι", "Μύκη", "Μύκονος", "Μυλοπόταμος", "Μώλος-Άγιος Κωνσταντίνος", "Νάξος και Μικρές Κυκλάδες", "Νάουσα", "Ναυπακτία", "Ναύπλιο", "Νέα Ζίχνη", "Νέα Ιωνία", "Νεάπολη-Συκιές", "Νέα Σμύρνης", "Νεμέα", "Νεστόριο", "Νέστος", "Νευροκόπι", "Νίκαια-Άγιος Ιωάννης Ρέντης", "Νικόλαος Σκουφάς", "Νίσυρος", "Νότια Κυνουρία", "Νοτιό Πήλιο", "Ξάνθη", "Ξηρόμερο", "Ξυλόκαστρο-Ευρωστίνα", "Οινούσσες", "Ορεστιάδα", "Ορεστίδα", "Οροπέδιο Λασιθίου", "Ορχομενός", "Παγγαίο", "Παιανία", "Παιονία", "Παλαιό Φάληρο", "Παλαμάς", "Παλλήνη", "Παξοί", "Παπάγος-Χολαργός", "Παρανέστι", "Πάργα", "Πάρος", "Πάτμος", "Πάτρα", "Παύλος Μελάς", "Πειραιάς", "Πεντέλη", "Πέραμα", "Περιστέρι", "Πετρούπολη", "Πηνειός", "Πλατανιάς", "Πολύγυρος", "Πόρος", "Πρέβεζα", "Πρέσπες", "Προσοτσάνη", "Πύδνα-Κολινδρός", "Πυλαία-Χορτιάτης", "Πύλη", "Πύργος", "Πωγώνι", "Ραφήνα-Πικέρμι", "Ρέθυμνο", "Ρήγας Φεραίος", "Ρόδος", "Σαλαμίνα", "Σαμoθράκη", "Σάμος", "Σαρωνικός", "Σέρβια-Βελβεντός", "Σέριφος", "Σέρρες", "Σητεία", "Σιθωνία", "Σίκινος", "Σικυώνα", "Σιντική", "Σίφνος", "Σκιάθος", "Σκόπελος", "Σκύδρα", "Σκύρος", "Σούλι", "Σουφλί", "Σοφάδες", "Σπάρτη", "Σπάτα-Άρτεμη", "Σπέτσες", "Στυλίδα", "Σύμη", "Σύρος-Ερμούπολη", "Σφακιά", "Τανάγρα", "Τέμπη", "Τήλος", "Τήνος", "Τόπειρος", "Τρίκαλα", "Τρίπολη", "Τριφυλλία", "Τροιζηνία", "Τύρναβος", "Ύδρα", "Φαιστός", "Φαρκαδόνας", "Φάρσαλα", "Φιλαδέλφεια-Χαλκηδόνα", "Φιλιάτες", "Φιλοθέη-Ψυχικό", "Φλώρινα", "Φολέγανδρος", "Φούρνοι", "Φυλή", "Χαϊδάρι", "Χαλάνδρι", "Χαλκηδόνα", "Χάλκη", "Χαλκίδα", "Χανιά", "Χερσόνησος", "Χίος", "Ψαρά", "Ωραιόκαστρο", "Ωρωπός Βαρβάρα", "Αγία", "Παρασκευή", "Άγιοι", "Ανάργυροι-Καματερό", "Άγιος", "Βασίλειος", "Άγιος", "Δημήτριος", "Άγιος", "Ευστράτιος", "Άγιος", "Νικόλαος", "Αγκίστρι", "Άγραφα", "Αγρίνιο", "Αθήνα", "Αιγάλεω", "Αιγιάλεια", "Αίγινα", "Άκτιο-Βόνιτσα", "Αλεξάνδρεια", "Αλεξανδρούπολη", "Αλίαρτος", "Άλιμος", "Αλμυρός", "Αλμωπία", "Αλόννησος", "Αμάρι", "Αμοργός", "Αμπελόκηποι-Μενεμένη", "Αμύνταιο", "Αμφίκλεια-Ελάτεια", "Αμφιλοχία", "Αμφίπολη", "Ανατολική", "Μάνη", "Ανάφη", "Ανδρίτσαινα-Κρέστενα", "Άνδρος", "Αντίπαρος", "Ανώγεια", "Αποκορώνας", "Αργιθέα", "Άργος-Μυκήνες", "Αριστοτέλης", "Αρριανά", "Άρτα", "Αρχαία", "Ολυμπία", "Αρχαία", "Πέλλα", "Αρχάνες-Αστερούσια", "Ασπρόπυργος", "Αστυπάλαια", "Αχαρνές", "Βάρη-Βούλα-Βουλιαγμένη", "Βέλο-Βόχα", "Βέροια", "Βιάννος", "Βισαλτία", "Βοΐο", "Βόλβη", "Βόλος", "Βόρεια", "Κυνουρία", "Βορεία", "Τζουμέρκα", "Βριλήσσια", "Βύρωνας", "Γαλάτσι", "Γαύδος", "Γεώργιος", "Καραϊσκάκης", "Γλυφάδα", "Γόρτυνα", "Γορτυνία", "Γρεβενά", "Δάφνη-Υμηττός", "Δέλτα", "Δελφοί", "Δεσκάτη", "Διδυμότειχο", "Δίον-Ολύμπος", "Διόνυσος", "Δίρφυς-Μεσσαπία", "Δίστομο-Αράχοβα-Αντικύρα", "Δομοκός", "Δοξάτο", "Δράμα", "Δυτική", "Αχαΐα", "Δυτική", "Μάνη", "Δυτική", "Οιχαλία", "Δυτική", "Πύλος-Νέστορας", "Δωδώνη", "Δωρίδα", "Έδεσσα", "Ελασσόνα", "Ελαφόνησος", "Ελευσίνα", "Ελληνικό-Αργυρούπολη", "Εμμανουήλ", "Παππάς", "Εορδαία", "Επίδαυρος", "Ερέτρια", "Ερμιονίδα", "Ερύμανθος", "Ευρώτας", "Ζαγορά-Μουρέσι", "Ζαγόρι", "Ζάκυνθος", "Ζαχάρω", "Ζηρός", "Ζίτσα", "Ζωγράφου", "Ηγουμενίτσα", "Ηλίδα", "Ηλιούπολη", "Ηράκλεια", "Ηράκλειο", "Ηράκλειο", "Θάσος", "Θερμαϊκός", "Θέρμη", "Θέρμο", "Θεσσαλονίκη", "Θήβα", "Θήρα", "Ίασμος", "Ιεράπετρα", "Ιθάκη", "Ικαριά", "Ίλιο", "Ίος", "Ιστιαία-Αιδηψός", "Ιωάννινα", "Καβάλα", "Καισαριανή", "Καλάβρυτα", "Καλαμαριά", "Καλαμάτα", "Καλαμπάκα", "Καλλιθέα", "Καλλικράτεια-Μουδανιά", "Κάλυμνος", "Κάνδανος-Σέλινο", "Καρδίτσα", "Κάρπαθος", "Καρπενήσι", "Κάρυστος", "Κάσος", "Κασσάνδρα", "Καστοριά", "Κατερίνη", "Κέα", "Κεντρικά", "Τζουμέρκα", "Κερατσίνι-Δραπετσώνα", "Κέρκυρα", "Κεφαλονιά", "Κηφισιά", "Κιλελέρ", "Κιλκίς", "Κίμωλος", "Κίσσαμος", "Κοζάνη", "Κομοτηνή", "Κόνιτσα", "Κορδελιό-Εύοσμος", "Κόρινθος", "Κορυδαλλός", "Κύθηρα", "Κύθνος", "Κυλλήνη", "Κύμη-Αλιβέρι", "Κωρωπί", "Κως", "Λαγκαδάς", "Λαμία", "Λάρισα", "Λαύριο", "Λειψοί", "Λέρος", "Λέσβος", "Λευκάδα", "Λήμνος", "Λιβαδειά", "Λίμνη", "Πλαστήρα", "Λοκροί", "Λουτράκι-Άγιoι", "Θεόδωροι", "Λυκόβρυση-Πεύκη", "Μακρακώμη", "Μαλεβίζι", "Μάνδρα-Ειδυλλία", "Μαντούδι-Λίμνη", "Μαραθώνα", "Μαρκόπουλο", "Μεσογαίας", "Μαρούσι", "Μαρώνεια-Σάπες", "Μεγαλόπολη", "Μεγανήσι", "Μέγαρα", "Μεγίστη", "Μεσολόγγι", "Μεσσήνη", "Μεταμόρφωση", "Μέτσοβο", "Μήλος", "Μινώα", "Πεδιάδα", "Μονεμβασιά", "Μοσχάτο-Ταύρος", "Μουζάκι", "Μύκη", "Μύκονος", "Μυλοπόταμος", "Μώλος-Άγιος", "Κωνσταντίνος", "Νάξος", "και", "Μικρές", "Κυκλάδες", "Νάουσα", "Ναυπακτία", "Ναύπλιο", "Νέα", "Ζίχνη", "Νέα", "Ιωνία", "Νεάπολη-Συκιές", "Νέα", "Σμύρνης", "Νεμέα", "Νεστόριο", "Νέστος", "Νευροκόπι", "Νίκαια-Άγιος", "Ιωάννης", "Ρέντης", "Νικόλαος", "Σκουφάς", "Νίσυρος", "Νότια", "Κυνουρία", "Νοτιό", "Πήλιο", "Ξάνθη", "Ξηρόμερο", "Ξυλόκαστρο-Ευρωστίνα", "Οινούσσες", "Ορεστιάδα", "Ορεστίδα", "Οροπέδιο", "Λασιθίου", "Ορχομενός", "Παγγαίο", "Παιανία", "Παιονία", "Παλαιό", "Φάληρο", "Παλαμάς", "Παλλήνη", "Παξοί", "Παπάγος-Χολαργός", "Παρανέστι", "Πάργα", "Πάρος", "Πάτμος", "Πάτρα", "Παύλος", "Μελάς", "Πειραιάς", "Πεντέλη", "Πέραμα", "Περιστέρι", "Πετρούπολη", "Πηνειός", "Πλατανιάς", "Πολύγυρος", "Πόρος", "Πρέβεζα", "Πρέσπες", "Προσοτσάνη", "Πύδνα-Κολινδρός", "Πυλαία-Χορτιάτης", "Πύλη", "Πύργος", "Πωγώνι", "Ραφήνα-Πικέρμι", "Ρέθυμνο", "Ρήγας", "Φεραίος", "Ρόδος", "Σαλαμίνα", "Σαμoθράκη", "Σάμος", "Σαρωνικός", "Σέρβια-Βελβεντός", "Σέριφος", "Σέρρες", "Σητεία", "Σιθωνία", "Σίκινος", "Σικυώνα", "Σιντική", "Σίφνος", "Σκιάθος", "Σκόπελος", "Σκύδρα", "Σκύρος", "Σούλι", "Σουφλί", "Σοφάδες", "Σπάρτη", "Σπάτα-Άρτεμη", "Σπέτσες", "Στυλίδα", "Σύμη", "Σύρος-Ερμούπολη", "Σφακιά", "Τανάγρα", "Τέμπη", "Τήλος", "Τήνος", "Τόπειρος", "Τρίκαλα", "Τρίπολη", "Τριφυλλία", "Τροιζηνία", "Τύρναβος", "Ύδρα", "Φαιστός", "Φαρκαδόνας", "Φάρσαλα", "Φιλαδέλφεια-Χαλκηδόνα", "Φιλιάτες", "Φιλοθέη-Ψυχικό", "Φλώρινα", "Φολέγανδρος", "Φούρνοι", "Φυλή", "Χαϊδάρι", "Χαλάνδρι", "Χαλκηδόνα", "Χάλκη", "Χαλκίδα", "Χανιά", "Χερσόνησος", "Χίος", "Ψαρά", "Ωραιόκαστρο", "Ωρωπός"
    };

    public Greece() {
        super();
        super.setDetails(freeDomain, domains, firstNameMale, firstNameFemale, lastNameMale, lastNameFemale, phoneFormats,
                county, county);
    }
}
