package com.Tunes_Developers.Countries;

/**
 * Created by Geoffrey-Kimani on 10/1/2017.
 */
public class Japan extends Country {
    //Domains
    private String [] freeDomain = {
            "org", "com", "net", "jp", "jp", "jp","biz", "info"
    };
    private String [] domains = {
            "gmail.com", "yahoo.co.jp", "hotmail.co.jp", "mail.goo.ne.jp"
    };
    //Names
    private String [] firstNameMale = {
            "晃", "篤司", "治", "和也", "京助", "健一", "修平", "翔太", "淳", "聡太郎", "太一", "太郎", "拓真", "翼", "智也",
            "直樹", "直人", "英樹", "浩", "学", "充", "稔", "裕樹", "裕太", "康弘", "陽一", "洋介", "亮介", "涼平", "零",
            "アキラ", "アケミ", "アスカ", "アツシ", "オサム",
            "カオリ", "カナ", "キョウスケ", "ケンイチ", "クミコ", "ケンイチ",
            "サユリ", "ジュン", "ソウタロウ",
            "タイチ", "タロウ", "チヨ", "タクマ", "ツバサ", "トモミ", "トモヤ",
            "ナオキ", "ナオコ", "ナオト", "ナナカ",
            "ハナコ", "ヒデキ", "ハルカ", "ヒロシ",
            "マアヤ", "マイ", "マナブ", "ミキ", "ミツル", "ミノル", "モモコ", "ヒロキ",
            "ユイ", "ユウタ", "ヤスヒロ", "ヨウイチ", "ヨウコ", "ヨウスケ", "ユミコ", "リョウスケ", "リョウヘイ", "レイ", "リカ",
    };
    private String [] firstNameFemale = {
            "明美", "あすか", "香織", "加奈", "くみ子", "さゆり", "知実", "千代",
            "直子", "七夏", "花子", "春香", "真綾", "舞", "美加子", "幹", "桃子", "結衣", "裕美子", "陽子", "里佳",
            "アキラ", "アケミ", "アスカ", "アツシ", "オサム",
            "カオリ", "カナ", "キョウスケ", "ケンイチ", "クミコ", "ケンイチ",
            "サユリ", "ジュン", "ソウタロウ",
            "タイチ", "タロウ", "チヨ", "タクマ", "ツバサ", "トモミ", "トモヤ",
            "ナオキ", "ナオコ", "ナオト", "ナナカ",
            "ハナコ", "ヒデキ", "ハルカ", "ヒロシ",
            "マアヤ", "マイ", "マナブ", "ミキ", "ミツル", "ミノル", "モモコ", "ヒロキ",
            "ユイ", "ユウタ", "ヤスヒロ", "ヨウイチ", "ヨウコ", "ヨウスケ", "ユミコ", "リョウスケ", "リョウヘイ", "レイ", "リカ",
    };
    private String [] lastName = {
            "青田", "青山", "石田", "井高", "伊藤", "井上", "宇野", "江古田", "大垣",
            "加藤", "加納", "喜嶋", "木村", "桐山", "工藤", "小泉", "小林", "近藤",
            "斉藤", "坂本", "佐々木", "佐藤", "笹田", "鈴木", "杉山",
            "高橋", "田中", "田辺", "津田",
            "中島", "中村", "渚", "中津川", "西之園", "野村",
            "原田", "浜田", "廣川", "藤本",
            "松本", "三宅", "宮沢", "村山",
            "山岸", "山口", "山田", "山本", "吉田", "吉本",
            "若松", "渡辺",
            "アオタ", "アオヤマ", "イシダ", "イダカ", "イトウ", "ウノ", "エコダ", "オオガキ",
            "カノウ", "カノウ", "キジマ", "キムラ", "キリヤマ", "クドウ", "コイズミ", "コバヤシ", "コンドウ",
            "サイトウ", "サカモト", "ササキ", "サトウ", "ササダ", "スズキ", "スギヤマ",
            "タカハシ", "タナカ", "タナベ", "ツダ",
            "ナカジマ", "ナカムラ", "ナギサ", "ナカツガワ", "ニシノソノ", "ノムラ",
            "ハラダ", "ハマダ", "ヒロカワ", "フジモト",
            "マツモト", "ミヤケ", "ミヤザワ", "ムラヤマ",
            "ヤマギシ", "ヤマグチ", "ヤマダ", "ヤマモト", "ヨシダ", "ヨシモト",
            "ワカマツ", "ワタナベ",
    };
    //Phone Numbers
    private String [] phoneFormats = {
            "080-####-####",
            "090-####-####",
            "0#-####-####",
            "0####-#-####",
            "0###-##-####",
            "0##-###-####",
            "0##0-###-###",
    };
    //Regions
    private String [] county = {
            "中央", "北", "東", "南", "西"
    };
    private String [] city = {
            "北海道",
            "青森県", "岩手県", "宮城県", "秋田県", "山形県", "福島県",
            "茨城県", "栃木県", "群馬県", "埼玉県", "千葉県", "東京都", "神奈川県",
            "新潟県", "富山県", "石川県", "福井県", "山梨県", "長野県", "岐阜県", "静岡県", "愛知県",
            "三重県", "滋賀県", "京都府", "大阪府", "兵庫県", "奈良県", "和歌山県",
            "鳥取県", "島根県", "岡山県", "広島県", "山口県",
            "徳島県", "香川県", "愛媛県", "高知県",
            "福岡県", "佐賀県", "長崎県", "熊本県", "大分県", "宮崎県", "鹿児島県",
            "沖縄県"
    };

    public Japan() {
        super();
        super.setDetails(freeDomain, domains, firstNameMale, firstNameFemale, lastName, lastName, phoneFormats,
                county, city);
    }
}
