package com.Tunes_Developers.Countries;

/**
 * Created by Geoffrey-Kimani on 10/1/2017.
 */
public class Russia extends Country {
    //Domains
    private String [] freeDomain = {
            "yandex.ru", "ya.ru", "narod.ru", "gmail.com", "mail.ru", "list.ru", "bk.ru", "inbox.ru", "rambler.ru", "hotmail.com"
    };
    private String [] domains = {
            "com", "com", "net", "org", "ru", "ru", "ru", "ru"
    };
    //Names
    private String [] firstNameMale = {
            "Абрам", "Август", "Адам", "Адриан", "Аким", "Александр", "Алексей", "Альберт", "Ананий", "Анатолий", "Андрей", "Антон", "Антонин",
            "Аполлон", "Аркадий", "Арсений", "Артемий", "Артур", "Артём", "Афанасий", "Богдан", "Болеслав", "Борис", "Бронислав", "Вадим",
            "Валентин", "Валериан", "Валерий", "Василий", "Вениамин", "Викентий", "Виктор", "Виль", "Виталий", "Витольд", "Влад", "Владимир",
            "Владислав", "Владлен", "Всеволод", "Вячеслав", "Гавриил", "Гарри", "Геннадий", "Георгий", "Герасим", "Герман", "Глеб", "Гордей",
            "Григорий", "Давид", "Дан", "Даниил", "Данила", "Денис", "Дмитрий", "Добрыня", "Донат", "Евгений", "Егор", "Ефим",
            "Захар", "Иван", "Игнат", "Игнатий", "Игорь", "Илларион", "Илья", "Иммануил", "Иннокентий", "Иосиф", "Ираклий", "Кирилл",
            "Клим", "Константин", "Кузьма", "Лаврентий", "Лев", "Леонид", "Макар", "Максим", "Марат", "Марк", "Матвей", "Милан",
            "Мирослав", "Михаил", "Назар", "Нестор", "Никита", "Никодим", "Николай", "Олег", "Павел", "Платон", "Прохор", "Пётр",
            "Радислав", "Рафаил", "Роберт", "Родион", "Роман", "Ростислав", "Руслан", "Сава", "Савва", "Святослав", "Семён", "Сергей",
            "Спартак", "Станислав", "Степан", "Стефан", "Тарас", "Тимофей", "Тимур", "Тит", "Трофим", "Феликс", "Филипп", "Фёдор",
            "Эдуард", "Эрик", "Юлиан", "Юлий", "Юрий", "Яков", "Ян", "Ярослав", "Милан",
    };
    private String [] firstNameFemale = {
            "Александра", "Алина", "Алиса", "Алла", "Альбина", "Алёна", "Анастасия", "Анжелика", "Анна", "Антонина", "Анфиса", "Валентина", "Валерия",
            "Варвара", "Василиса", "Вера", "Вероника", "Виктория", "Владлена", "Галина", "Дарья", "Диана", "Дина", "Доминика", "Ева",
            "Евгения", "Екатерина", "Елена", "Елизавета", "Жанна", "Зинаида", "Злата", "Зоя", "Изабелла", "Изольда", "Инга", "Инесса",
            "Инна", "Ирина", "Искра", "Капитолина", "Клавдия", "Клара", "Клементина", "Кристина", "Ксения", "Лада", "Лариса", "Лидия",
            "Лилия", "Любовь", "Людмила", "Люся", "Майя", "Мальвина", "Маргарита", "Марина", "Мария", "Марта", "Надежда", "Наталья",
            "Нелли", "Ника", "Нина", "Нонна", "Оксана", "Олеся", "Ольга", "Полина", "Рада", "Раиса", "Регина", "Рената",
            "Розалина", "Светлана", "Софья", "София", "Таисия", "Тамара", "Татьяна", "Ульяна", "Фаина", "Федосья", "Флорентина", "Эльвира", "Эмилия",
    };
    private String [] lastName = {
            "Смирнов", "Иванов", "Кузнецов", "Соколов", "Попов", "Лебедев", "Козлов",
            "Новиков", "Морозов", "Петров", "Волков", "Соловьёв", "Васильев", "Зайцев",
            "Павлов", "Семёнов", "Голубев", "Виноградов", "Богданов", "Воробьёв",
            "Фёдоров", "Михайлов", "Беляев", "Тарасов", "Белов", "Комаров", "Орлов",
            "Киселёв", "Макаров", "Андреев", "Ковалёв", "Ильин", "Гусев", "Титов",
            "Кузьмин", "Кудрявцев", "Баранов", "Куликов", "Алексеев", "Степанов",
            "Яковлев", "Сорокин", "Сергеев", "Романов", "Захаров", "Борисов", "Королёв",
            "Герасимов", "Пономарёв", "Григорьев", "Лазарев", "Медведев", "Ершов",
            "Никитин", "Соболев", "Рябов", "Поляков", "Цветков", "Данилов", "Жуков",
            "Фролов", "Журавлёв", "Николаев", "Крылов", "Максимов", "Сидоров", "Осипов",
            "Белоусов", "Федотов", "Дорофеев", "Егоров", "Матвеев", "Бобров", "Дмитриев",
            "Калинин", "Анисимов", "Петухов", "Антонов", "Тимофеев", "Никифоров",
            "Веселов", "Филиппов", "Марков", "Большаков", "Суханов", "Миронов", "Ширяев",
            "Александров", "Коновалов", "Шестаков", "Казаков", "Ефимов", "Денисов",
            "Громов", "Фомин", "Давыдов", "Мельников", "Щербаков", "Блинов", "Колесников",
            "Карпов", "Афанасьев", "Власов", "Маслов", "Исаков", "Тихонов", "Аксёнов",
            "Гаврилов", "Родионов", "Котов", "Горбунов", "Кудряшов", "Быков", "Зуев",
            "Третьяков", "Савельев", "Панов", "Рыбаков", "Суворов", "Абрамов", "Воронов",
            "Мухин", "Архипов", "Трофимов", "Мартынов", "Емельянов", "Горшков", "Чернов",
            "Овчинников", "Селезнёв", "Панфилов", "Копылов", "Михеев", "Галкин", "Назаров",
            "Лобанов", "Лукин", "Беляков", "Потапов", "Некрасов", "Хохлов", "Жданов",
            "Наумов", "Шилов", "Воронцов", "Ермаков", "Дроздов", "Игнатьев", "Савин",
            "Логинов", "Сафонов", "Капустин", "Кириллов", "Моисеев", "Елисеев", "Кошелев",
            "Костин", "Горбачёв", "Орехов", "Ефремов", "Исаев", "Евдокимов", "Калашников",
            "Кабанов", "Носков", "Юдин", "Кулагин", "Лапин", "Прохоров", "Нестеров",
            "Харитонов", "Агафонов", "Муравьёв", "Ларионов", "Федосеев", "Зимин", "Пахомов",
            "Шубин", "Игнатов", "Филатов", "Крюков", "Рогов", "Кулаков", "Терентьев",
            "Молчанов", "Владимиров", "Артемьев", "Гурьев", "Зиновьев", "Гришин", "Кононов",
            "Дементьев", "Ситников", "Симонов", "Мишин", "Фадеев", "Комиссаров", "Мамонтов",
            "Носов", "Гуляев", "Шаров", "Устинов", "Вишняков", "Евсеев", "Лаврентьев",
            "Брагин", "Константинов", "Корнилов", "Авдеев", "Зыков", "Бирюков", "Шарапов",
            "Никонов", "Щукин", "Дьячков", "Одинцов", "Сазонов", "Якушев", "Красильников",
            "Гордеев", "Самойлов", "Князев", "Беспалов", "Уваров", "Шашков", "Бобылёв",
            "Доронин", "Белозёров", "Рожков", "Самсонов", "Мясников", "Лихачёв", "Буров",
            "Сысоев", "Фомичёв", "Русаков", "Стрелков", "Гущин", "Тетерин", "Колобов",
            "Субботин", "Фокин", "Блохин", "Селиверстов", "Пестов", "Кондратьев", "Силин",
            "Меркушев", "Лыткин", "Туров",
    };
    //Phone Numbers
    private String [] phoneFormats = {
            "(812) ###-##-##",
            "(495) ###-####",
            "+7 (922) ###-####",
            "(35222) ##-####",
            "8-800-###-####",
    };
    //Regions
    private String [] county = {
            "Амурская", "Архангельская", "Астраханская", "Белгородская", "Брянская",
            "Владимирская", "Волгоградская", "Вологодская", "Воронежская", "Ивановская",
            "Иркутская", "Калининградская", "Калужская", "Кемеровская", "Кировская",
            "Костромская", "Курганская", "Курская", "Ленинградская", "Липецкая",
            "Магаданская", "Московская", "Мурманская", "Нижегородская", "Новгородская",
            "Новосибирская", "Омская", "Оренбургская", "Орловская", "Пензенская",
            "Псковская", "Ростовская", "Рязанская", "Самарская", "Саратовская",
            "Сахалинская", "Свердловская", "Смоленская", "Тамбовская", "Тверская",
            "Томская", "Тульская", "Тюменская", "Ульяновская", "Челябинская",
            "Читинская", "Ярославская",
    };
    private String [] city = {
            "Балашиха", "Видное", "Волоколамск", "Воскресенск", "Дмитров",
            "Домодедово", "Дорохово", "Егорьевск", "Зарайск", "Истра",
            "Кашира", "Клин", "Коломна", "Красногорск", "Лотошино",
            "Луховицы", "Люберцы", "Можайск", "Москва", "Мытищи",
            "Наро-Фоминск", "Ногинск", "Одинцово", "Озёры", "Орехово-Зуево",
            "Павловский Посад", "Подольск", "Пушкино", "Раменское", "Сергиев Посад",
            "Серебряные Пруды", "Серпухов", "Солнечногорск", "Ступино", "Талдом",
            "Чехов", "Шатура", "Шаховская", "Щёлково",
    };
    private String [] street = {
            "Косиора", "Ладыгина", "Ленина", "Ломоносова", "Домодедовская", "Гоголя", "1905 года", "Чехова", "Сталина",
            "Космонавтов", "Гагарина", "Славы", "Бухарестская", "Будапештсткая", "Балканская"
    };

    public Russia() {
        super();
        super.setDetails(freeDomain, domains, firstNameMale, firstNameFemale, lastName, lastName, phoneFormats,
                county, city);
    }
}
